urixie/ESP32S3_Para_Update_Tools/esp32s3/components/app_web_file_server/app_web_file_server.c
#include "app_web_file_server.h"

#include <ctype.h>
#include <dirent.h>
#include <errno.h>
#include <stdbool.h>
#include <stdio.h>
#include <stdint.h>
#include <stdlib.h>
#include <string.h>
#include <strings.h>
#include <sys/stat.h>
#include <unistd.h>

#include "app_param_bin.h"
#include "app_storage_lock.h"
#include "esp_check.h"
#include "esp_heap_caps.h"
#include "esp_http_server.h"
#include "esp_idf_version.h"
#include "esp_log.h"
#include "esp_random.h"
#include "esp_timer.h"

#define APP_WEB_MAX_PATH 320
#define APP_WEB_IO_BUF_SIZE 2048
#define APP_WEB_UPLOAD_BUF_SIZE 4096
#define WEB_AUTH_USER "admin"
#define WEB_AUTH_PASS "admin"
#define WEB_AUTH_SESSION_BYTES 32
#define WEB_AUTH_SESSION_HEX_LEN (WEB_AUTH_SESSION_BYTES * 2)
#define WEB_AUTH_SESSION_TIMEOUT_US (30LL * 60LL * 1000000LL)

static const char *TAG = "web_param";
static httpd_handle_t s_server;
static char s_mount_point[64];
static char s_session_id[WEB_AUTH_SESSION_HEX_LEN + 1];
static bool s_session_valid;
static int64_t s_session_expire_us;

extern const uint8_t login_html_start[] asm("_binary_login_html_start");
extern const uint8_t login_html_end[] asm("_binary_login_html_end");
extern const uint8_t app_html_start[] asm("_binary_app_html_start");
extern const uint8_t app_html_end[] asm("_binary_app_html_end");

static void log_heap_state(const char *where)
{
    ESP_LOGI(TAG, "heap %s: free=%lu, min=%lu, internal=%u, psram=%u",
             where,
             (unsigned long)esp_get_free_heap_size(),
             (unsigned long)esp_get_minimum_free_heap_size(),
             (unsigned int)heap_caps_get_free_size(MALLOC_CAP_INTERNAL),
             (unsigned int)heap_caps_get_free_size(MALLOC_CAP_SPIRAM));
}

static void set_connection_close(httpd_req_t *req)
{
    httpd_resp_set_hdr(req, "Connection", "close");
}

static int hex_value(char c)
{
    if (c >= '0' && c <= '9') {
        return c - '0';
    }
    if (c >= 'a' && c <= 'f') {
        return c - 'a' + 10;
    }
    if (c >= 'A' && c <= 'F') {
        return c - 'A' + 10;
    }
    return -1;
}

static esp_err_t url_decode(char *dst, size_t dst_size, const char *src)
{
    size_t out = 0;
    for (size_t i = 0; src != NULL && src[i] != '\0'; i++) {
        if (out + 1 >= dst_size) {
            return ESP_ERR_INVALID_SIZE;
        }
        if (src[i] == '%' && isxdigit((unsigned char)src[i + 1]) && isxdigit((unsigned char)src[i + 2])) {
            int hi = hex_value(src[i + 1]);
            int lo = hex_value(src[i + 2]);
            if (hi < 0 || lo < 0) {
                return ESP_ERR_INVALID_ARG;
            }
            dst[out++] = (char)((hi << 4) | lo);
            i += 2;
        } else if (src[i] == '+') {
            dst[out++] = ' ';
        } else {
            dst[out++] = src[i];
        }
    }
    dst[out] = '\0';
    return ESP_OK;
}

static bool has_bad_path_chars(const char *path)
{
    return path == NULL || strstr(path, "..") != NULL || strchr(path, '\\') != NULL || strchr(path, ':') != NULL;
}

static bool ends_with_ignore_case(const char *s, const char *suffix)
{
    if (s == NULL || suffix == NULL) {
        return false;
    }
    size_t sl = strlen(s);
    size_t xl = strlen(suffix);
    return sl >= xl && strcasecmp(s + sl - xl, suffix) == 0;
}

static esp_err_t build_storage_path(const char *path, bool allow_root, char *out, size_t out_size)
{
    char decoded[APP_WEB_MAX_PATH];
    ESP_RETURN_ON_ERROR(url_decode(decoded, sizeof(decoded), path != NULL ? path : ""), TAG, "decode failed");

    while (decoded[0] == '/') {
        memmove(decoded, decoded + 1, strlen(decoded));
    }

    if (decoded[0] == '\0') {
        if (!allow_root) {
            return ESP_ERR_INVALID_ARG;
        }
        int len = snprintf(out, out_size, "%s", s_mount_point);
        return (len > 0 && (size_t)len < out_size) ? ESP_OK : ESP_ERR_INVALID_SIZE;
    }

    if (has_bad_path_chars(decoded)) {
        return ESP_ERR_INVALID_ARG;
    }

    int len = snprintf(out, out_size, "%s/%s", s_mount_point, decoded);
    if (len <= 0 || (size_t)len >= out_size) {
        return ESP_ERR_INVALID_SIZE;
    }
    return ESP_OK;
}

static esp_err_t get_query_value(httpd_req_t *req, const char *key, char *out, size_t out_size)
{
    char query[APP_WEB_MAX_PATH];
    if (httpd_req_get_url_query_str(req, query, sizeof(query)) != ESP_OK) {
        return ESP_ERR_NOT_FOUND;
    }
    if (httpd_query_key_value(query, key, out, out_size) != ESP_OK) {
        return ESP_ERR_NOT_FOUND;
    }
    return ESP_OK;
}

static bool valid_upload_name(const char *name)
{
    if (name == NULL || name[0] == '\0' || has_bad_path_chars(name)) {
        return false;
    }
    for (const char *p = name; *p != '\0'; p++) {
        unsigned char c = (unsigned char)*p;
        if (c < 0x20 || *p == '/' || *p == '*' || *p == '?' || *p == '"' || *p == '<' || *p == '>' || *p == '|') {
            return false;
        }
    }
    return true;
}

static void json_escape_send(httpd_req_t *req, const char *text)
{
    if (text == NULL) {
        return;
    }
    for (const char *p = text; *p != '\0'; p++) {
        char esc[7];
        switch (*p) {
        case '\\':
            httpd_resp_sendstr_chunk(req, "\\\\");
            break;
        case '"':
            httpd_resp_sendstr_chunk(req, "\\\"");
            break;
        case '\n':
            httpd_resp_sendstr_chunk(req, "\\n");
            break;
        case '\r':
            httpd_resp_sendstr_chunk(req, "\\r");
            break;
        case '\t':
            httpd_resp_sendstr_chunk(req, "\\t");
            break;
        default:
            if ((unsigned char)*p < 0x20) {
                snprintf(esc, sizeof(esc), "\\u%04x", (unsigned char)*p);
                httpd_resp_sendstr_chunk(req, esc);
            } else {
                httpd_resp_send_chunk(req, p, 1);
            }
            break;
        }
    }
}

static esp_err_t send_json_error(httpd_req_t *req, const char *status, const char *message)
{
    httpd_resp_set_status(req, status);
    httpd_resp_set_type(req, "application/json; charset=utf-8");
    set_connection_close(req);
    httpd_resp_sendstr_chunk(req, "{\"ok\":false,\"error\":\"");
    json_escape_send(req, message);
    httpd_resp_sendstr_chunk(req, "\"}");
    return httpd_resp_send_chunk(req, NULL, 0);
}

static esp_err_t send_embedded_html(httpd_req_t *req, const uint8_t *start, const uint8_t *end)
{
    httpd_resp_set_type(req, "text/html; charset=utf-8");
    set_connection_close(req);
    return httpd_resp_send(req, (const char *)start, end - start);
}

static esp_err_t redirect_to_login(httpd_req_t *req)
{
    httpd_resp_set_status(req, "302 Found");
    httpd_resp_set_hdr(req, "Location", "/");
    set_connection_close(req);
    return httpd_resp_send(req, NULL, 0);
}

static void web_auth_refresh_expire(void)
{
    s_session_expire_us = esp_timer_get_time() + WEB_AUTH_SESSION_TIMEOUT_US;
}

static void web_auth_clear_session(void)
{
    memset(s_session_id, 0, sizeof(s_session_id));
    s_session_valid = false;
    s_session_expire_us = 0;
}

static void web_auth_create_session(void)
{
    uint8_t random_bytes[WEB_AUTH_SESSION_BYTES];
    static const char hex[] = "0123456789abcdef";

