urixie/ESP32S3_Para_Update_Tools/esp32s3/components/app_web_file_server/app_web_file_server.c
    esp_fill_random(random_bytes, sizeof(random_bytes));
    for (size_t i = 0; i < sizeof(random_bytes); i++) {
        s_session_id[i * 2] = hex[random_bytes[i] >> 4];
        s_session_id[i * 2 + 1] = hex[random_bytes[i] & 0x0f];
    }
    s_session_id[WEB_AUTH_SESSION_HEX_LEN] = '\0';
    s_session_valid = true;
    web_auth_refresh_expire();
}

static bool cookie_has_sid(const char *cookie_header, const char *sid)
{
    const char *p = cookie_header;
    size_t sid_len = strlen(sid);

    while (p != NULL && *p != '\0') {
        while (*p == ' ' || *p == ';') {
            p++;
        }

        const char *end = strchr(p, ';');
        size_t len = end != NULL ? (size_t)(end - p) : strlen(p);
        while (len > 0 && isspace((unsigned char)p[len - 1])) {
            len--;
        }

        const char key[] = "sid=";
        if (len == sizeof(key) - 1 + sid_len &&
            strncmp(p, key, sizeof(key) - 1) == 0 &&
            memcmp(p + sizeof(key) - 1, sid, sid_len) == 0) {
            return true;
        }

        p = end != NULL ? end + 1 : NULL;
    }

    return false;
}

static bool web_auth_is_logged_in(httpd_req_t *req)
{
    if (!s_session_valid || s_session_id[0] == '\0') {
        return false;
    }
    if (esp_timer_get_time() > s_session_expire_us) {
        web_auth_clear_session();
        return false;
    }

    size_t cookie_len = httpd_req_get_hdr_value_len(req, "Cookie");
    if (cookie_len == 0) {
        return false;
    }

    char *cookie = malloc(cookie_len + 1);
    if (cookie == NULL) {
        return false;
    }

    bool ok = false;
    if (httpd_req_get_hdr_value_str(req, "Cookie", cookie, cookie_len + 1) == ESP_OK) {
        ok = cookie_has_sid(cookie, s_session_id);
    }
    free(cookie);

    if (ok) {
        web_auth_refresh_expire();
    }
    return ok;
}

static esp_err_t read_form_body(httpd_req_t *req, char *body, size_t body_size)
{
    if (req->content_len <= 0 || req->content_len >= body_size) {
        return ESP_ERR_INVALID_SIZE;
    }

    int remaining = req->content_len;
    int offset = 0;
    while (remaining > 0) {
        int recv_len = httpd_req_recv(req, body + offset, remaining);
        if (recv_len <= 0) {
            return ESP_FAIL;
        }
        remaining -= recv_len;
        offset += recv_len;
    }
    body[offset] = '\0';
    return ESP_OK;
}

static esp_err_t get_form_value_decoded(const char *body, const char *key, char *out, size_t out_size)
{
    char encoded[APP_WEB_MAX_PATH];
    if (httpd_query_key_value(body, key, encoded, sizeof(encoded)) != ESP_OK) {
        return ESP_ERR_NOT_FOUND;
    }
    return url_decode(out, out_size, encoded);
}

static esp_err_t index_handler(httpd_req_t *req)
{
    log_heap_state("before index");
    if (web_auth_is_logged_in(req)) {
        httpd_resp_set_status(req, "302 Found");
        httpd_resp_set_hdr(req, "Location", "/app");
        set_connection_close(req);
        return httpd_resp_send(req, NULL, 0);
    }
    return send_embedded_html(req, login_html_start, login_html_end);
}

static esp_err_t app_handler(httpd_req_t *req)
{
    log_heap_state("before app");
    if (!web_auth_is_logged_in(req)) {
        return redirect_to_login(req);
    }
    return send_embedded_html(req, app_html_start, app_html_end);
}

static esp_err_t login_handler(httpd_req_t *req)
{
    char body[APP_WEB_MAX_PATH];
    char username[64];
    char password[96];

    if (read_form_body(req, body, sizeof(body)) != ESP_OK ||
        get_form_value_decoded(body, "username", username, sizeof(username)) != ESP_OK ||
        get_form_value_decoded(body, "password", password, sizeof(password)) != ESP_OK) {
        return send_json_error(req, "400 Bad Request", "登录请求格式错误");
    }

    if (strcmp(username, WEB_AUTH_USER) != 0 || strcmp(password, WEB_AUTH_PASS) != 0) {
        return send_json_error(req, "401 Unauthorized", "用户名或密码错误");
    }

    if (s_session_valid && esp_timer_get_time() > s_session_expire_us) {
        web_auth_clear_session();
    }

    if (s_session_valid && s_session_id[0] != '\0') {
        if (web_auth_is_logged_in(req)) {
            httpd_resp_set_type(req, "application/json; charset=utf-8");
            set_connection_close(req);
            return httpd_resp_sendstr(req, "{\"ok\":true}");
        }
        return send_json_error(req, "409 Conflict", "已有用户登录，请先退出当前会话或等待会话过期");
    }

    web_auth_create_session();

    char cookie[128];
    snprintf(cookie, sizeof(cookie), "sid=%s; Path=/; HttpOnly; SameSite=Lax; Max-Age=1800", s_session_id);
    httpd_resp_set_hdr(req, "Set-Cookie", cookie);
    httpd_resp_set_type(req, "application/json; charset=utf-8");
    set_connection_close(req);
    return httpd_resp_sendstr(req, "{\"ok\":true}");
}

static esp_err_t logout_handler(httpd_req_t *req)
{
    if (!s_session_valid || web_auth_is_logged_in(req)) {
        web_auth_clear_session();
    }
    httpd_resp_set_hdr(req, "Set-Cookie", "sid=; Path=/; Max-Age=0; HttpOnly; SameSite=Lax");
    httpd_resp_set_type(req, "application/json; charset=utf-8");
    set_connection_close(req);
    return httpd_resp_sendstr(req, "{\"ok\":true}");
}

static esp_err_t auth_status_handler(httpd_req_t *req)
{
    httpd_resp_set_type(req, "application/json; charset=utf-8");
    if (web_auth_is_logged_in(req)) {
        set_connection_close(req);
        return httpd_resp_sendstr(req, "{\"ok\":true,\"login\":true,\"user\":\"admin\"}");
    }

    httpd_resp_set_status(req, "401 Unauthorized");
    set_connection_close(req);
    return httpd_resp_sendstr(req, "{\"ok\":false,\"login\":false}");
}

static esp_err_t favicon_handler(httpd_req_t *req)
{
    httpd_resp_set_status(req, "204 No Content");
    set_connection_close(req);
    return httpd_resp_send(req, NULL, 0);
}

static const char *content_type_from_path(const char *path)
{
    const char *ext = strrchr(path, '.');
    if (ext != NULL) {
        if (strcasecmp(ext, ".png") == 0) {
            return "image/png";
        }
        if (strcasecmp(ext, ".jpg") == 0 || strcasecmp(ext, ".jpeg") == 0) {
            return "image/jpeg";
        }
        if (strcasecmp(ext, ".html") == 0 || strcasecmp(ext, ".htm") == 0) {
            return "text/html; charset=utf-8";
        }
        if (strcasecmp(ext, ".txt") == 0 || strcasecmp(ext, ".log") == 0) {
            return "text/plain; charset=utf-8";
        }
    }
    return "application/octet-stream";
}

