urixie/ESP32S3_Para_Update_Tools/esp32s3/components/app_web_file_server/app_web_file_server.c
static void send_param_json(httpd_req_t *req, const app_param_bin_parameter_t *p, bool first)
{
    char buf[192];
    snprintf(buf, sizeof(buf),
             "%s{\"address\":%u,\"name\":\"",
             first ? "" : ",",
             p->address);
    httpd_resp_sendstr_chunk(req, buf);
    json_escape_send(req, p->name);
    snprintf(buf, sizeof(buf),
             "\",\"defaultValue\":%u,\"paramType\":\"%s\",\"paramTypeLabel\":\"%s\",\"permission\":\"%s\",\"permissionLabel\":\"%s\"}",
             p->default_value,
             app_param_bin_type_name(p->param_type),
             app_param_bin_type_label(p->param_type),
             app_param_bin_permission_name(p->permission),
             app_param_bin_permission_label(p->permission));
    httpd_resp_sendstr_chunk(req, buf);
}

static esp_err_t bin_parse_handler(httpd_req_t *req)
{
    if (!web_auth_is_logged_in(req)) {
        return send_json_error(req, "401 Unauthorized", "请先登录");
    }

    char raw_path[APP_WEB_MAX_PATH];
    char full_path[APP_WEB_MAX_PATH];
    if (get_query_value(req, "path", raw_path, sizeof(raw_path)) != ESP_OK ||
        build_storage_path(raw_path, false, full_path, sizeof(full_path)) != ESP_OK) {
        return send_json_error(req, "400 Bad Request", "路径无效");
    }

    if (!ends_with_ignore_case(full_path, ".bin")) {
        return send_json_error(req, "400 Bad Request", "只支持解析 .bin 文件");
    }

    app_param_bin_result_t parsed;
    char parse_error[160];
    parse_error[0] = '\0';

    if (app_storage_lock(portMAX_DELAY) != ESP_OK) {
        return send_json_error(req, "503 Service Unavailable", "文件系统忙");
    }
    esp_err_t ret = app_param_bin_parse_file(full_path, &parsed, parse_error, sizeof(parse_error));
    app_storage_unlock();

    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "parse failed %s: %s", full_path, parse_error);
        return send_json_error(req, "422 Unprocessable Entity", parse_error[0] != '\0' ? parse_error : "解析失败");
    }

    httpd_resp_set_type(req, "application/json; charset=utf-8");
    set_connection_close(req);

    char hdr[360];
    snprintf(hdr, sizeof(hdr),
             "{\"ok\":true,\"file\":{\"path\":\"");
    httpd_resp_sendstr_chunk(req, hdr);
    json_escape_send(req, raw_path);
    snprintf(hdr, sizeof(hdr),
             "\"},\"header\":{\"headerSize\":%u,\"formatVersion\":%u,\"nonceHex\":\"%s\",\"ciphertextLen\":%lu,\"tagLen\":%u,\"fileSize\":%lu},\"parameters\":[",
             parsed.header_size,
             parsed.format_version,
             parsed.nonce_hex,
             (unsigned long)parsed.ciphertext_len,
             parsed.tag_len,
             (unsigned long)parsed.file_size);
    httpd_resp_sendstr_chunk(req, hdr);

    for (size_t i = 0; i < APP_PARAM_BIN_PARAM_COUNT; i++) {
        send_param_json(req, &parsed.parameters[i], i == 0);
    }

    httpd_resp_sendstr_chunk(req, "]}");
    return httpd_resp_send_chunk(req, NULL, 0);
}

esp_err_t app_web_file_server_start(const char *mount_point)
{
    ESP_RETURN_ON_FALSE(mount_point != NULL && mount_point[0] == '/', ESP_ERR_INVALID_ARG,
                        TAG, "invalid mount point");

    if (s_server != NULL) {
        return ESP_OK;
    }

    int len = snprintf(s_mount_point, sizeof(s_mount_point), "%s", mount_point);
    ESP_RETURN_ON_FALSE(len > 0 && (size_t)len < sizeof(s_mount_point), ESP_ERR_INVALID_SIZE,
                        TAG, "mount point too long");

    log_heap_state("before server start");

    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    config.server_port = 80;
    config.uri_match_fn = httpd_uri_match_wildcard;
    config.stack_size = 12288;
    config.max_uri_handlers = 12;
    config.max_open_sockets = 4;
    config.lru_purge_enable = true;
    config.recv_wait_timeout = 60;
    config.send_wait_timeout = 30;
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
    config.keep_alive_enable = false;
#endif

    ESP_RETURN_ON_ERROR(httpd_start(&s_server, &config), TAG, "httpd_start failed");
    log_heap_state("after server start");

    const httpd_uri_t index_uri = {.uri = "/", .method = HTTP_GET, .handler = index_handler};
    const httpd_uri_t app_uri = {.uri = "/app", .method = HTTP_GET, .handler = app_handler};
    const httpd_uri_t login_uri = {.uri = "/api/login", .method = HTTP_POST, .handler = login_handler};
    const httpd_uri_t logout_uri = {.uri = "/api/logout", .method = HTTP_POST, .handler = logout_handler};
    const httpd_uri_t auth_status_uri = {.uri = "/api/auth/status", .method = HTTP_GET, .handler = auth_status_handler};
    const httpd_uri_t favicon_uri = {.uri = "/favicon.ico", .method = HTTP_GET, .handler = favicon_handler};
    const httpd_uri_t files_uri = {.uri = "/files", .method = HTTP_GET, .handler = files_handler};
    const httpd_uri_t download_uri = {.uri = "/download", .method = HTTP_GET, .handler = download_handler};
    const httpd_uri_t upload_uri = {.uri = "/upload", .method = HTTP_POST, .handler = upload_handler};
    const httpd_uri_t delete_uri = {.uri = "/delete", .method = HTTP_POST, .handler = delete_handler};
    const httpd_uri_t bin_parse_uri = {.uri = "/api/bin/parse", .method = HTTP_GET, .handler = bin_parse_handler};

    esp_err_t ret = httpd_register_uri_handler(s_server, &index_uri);
    ESP_GOTO_ON_ERROR(ret, err_stop, TAG, "register / failed");
    ret = httpd_register_uri_handler(s_server, &app_uri);
    ESP_GOTO_ON_ERROR(ret, err_stop, TAG, "register /app failed");
    ret = httpd_register_uri_handler(s_server, &login_uri);
    ESP_GOTO_ON_ERROR(ret, err_stop, TAG, "register /api/login failed");
    ret = httpd_register_uri_handler(s_server, &logout_uri);
    ESP_GOTO_ON_ERROR(ret, err_stop, TAG, "register /api/logout failed");
    ret = httpd_register_uri_handler(s_server, &auth_status_uri);
    ESP_GOTO_ON_ERROR(ret, err_stop, TAG, "register /api/auth/status failed");
    ret = httpd_register_uri_handler(s_server, &favicon_uri);
    ESP_GOTO_ON_ERROR(ret, err_stop, TAG, "register /favicon.ico failed");
    ret = httpd_register_uri_handler(s_server, &files_uri);
    ESP_GOTO_ON_ERROR(ret, err_stop, TAG, "register /files failed");
    ret = httpd_register_uri_handler(s_server, &download_uri);
    ESP_GOTO_ON_ERROR(ret, err_stop, TAG, "register /download failed");
    ret = httpd_register_uri_handler(s_server, &upload_uri);
    ESP_GOTO_ON_ERROR(ret, err_stop, TAG, "register /upload failed");
    ret = httpd_register_uri_handler(s_server, &delete_uri);
    ESP_GOTO_ON_ERROR(ret, err_stop, TAG, "register /delete failed");
    ret = httpd_register_uri_handler(s_server, &bin_parse_uri);
    ESP_GOTO_ON_ERROR(ret, err_stop, TAG, "register /api/bin/parse failed");

    ESP_LOGI(TAG, "HTTP parameter bin server started at mount point %s", s_mount_point);
    return ESP_OK;

err_stop:
    httpd_stop(s_server);
    s_server = NULL;
    return ret;
}
